src/toir_cf/src/Catalogs/торо_ТехКарты/торо_ТехКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТехКарты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержитОпасныеОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитРаботыПовышеннойОпасности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнениеРемонтаТребуетОстановаОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростоя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПростоя</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремениТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростояТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПродолжительности</name>
    <type>
      <types>EnumRef.торо_СпособыРасчетаПродолжительности</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданаАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОпераций</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГраницаЛев</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГраницаПрав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремениВСекундах</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID_ПараллельнойОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериальныеЗатраты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.ГрадацииКачества</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТрудовыеЗатраты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>Время работы персонала данной квалификации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество работников данной квалификации необходимое для выполнения тех.операции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнструментыИТехника</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Инструмент</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>Время работы персонала данной квалификации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмеряемыеПоказатели</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОказываемыеУслуги</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МерыБезопасности</name>
    <attributes>
      <name>МераБезопасности</name>
      <type>
        <types>CatalogRef.торо_МерыБезопасности</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВерсииТехКарт</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Catalogs/торо_ТехКарты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда
		Если Ссылка.СодержитОпасныеОперации <> СодержитОпасныеОперации Тогда
			ДополнительныеСвойства.Вставить("ИзменилосьНаличиеОпасныхОпераций", Истина);
		КонецЕсли;
		
		Если Ссылка.СодержитРаботыПовышеннойОпасности <> СодержитРаботыПовышеннойОпасности Тогда
			ДополнительныеСвойства.Вставить("ИзменилосьНаличиеРаботПовышеннойОпасности", Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьЗаписиРегистраСоставИерархическихТехкартРемонтов();
	ОбновитьНаличиеОпасныхОперацийВВышележащихТехКартах();
	торо_ПланированиеРемонтов.ПометитьКОбновлениюПроектныеЗатратыНаРемонтыПриЗаписиТехКарты(Ссылка);
	
КонецПроцедуры

Процедура ПриЧтенииПредставленийНаСервере() Экспорт
    МультиязычностьСервер.ПриЧтенииПредставленийНаСервере(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьЗаписиРегистраСоставИерархическихТехкартРемонтов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА торо_ТехКартыСписокОпераций.Операция ССЫЛКА Справочник.торо_ИдентификаторыТехКарт
	               |			ТОГДА торо_ВерсииТехКартСрезПоследних.ТехКарта
	               |		ИНАЧЕ торо_ТехКартыСписокОпераций.Операция
	               |	КОНЕЦ КАК Состав,
	               |	ВЫБОР
	               |		КОГДА торо_ТехКартыСписокОпераций.Операция ССЫЛКА Справочник.торо_ИдентификаторыТехКарт
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Операция_Техкарта,
	               |	торо_ТехКартыСписокОпераций.Количество
	               |ИЗ
	               |	Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&ДатаПринятия) КАК торо_ВерсииТехКартСрезПоследних
	               |		ПО торо_ТехКартыСписокОпераций.Операция = торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты
	               |ГДЕ
	               |	торо_ТехКартыСписокОпераций.Ссылка = &Ссылка
	               |	И торо_ТехКартыСписокОпераций.Операция ССЫЛКА Справочник.торо_ИдентификаторыТехКарт";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("ДатаПринятия", новый Граница(ДатаПринятия,ВидГраницы.Включая));
	
	ТабДанных = Запрос.Выполнить().Выгрузить();
	ТабЗаписи = ТабДанных.Скопировать();
	
	Для каждого ТекСтрока Из ТабДанных Цикл
		ДополнитьТаблицуТехкарт(ТекСтрока.Состав,ТабЗаписи);
	КонецЦикла;
	
	ТабЗаписи.Свернуть("Состав","Количество");
	
	НаборЗаписей = РегистрыСведений.торо_СоставИерархическихТехкартРемонтов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Техкарта.Установить(Ссылка);
	
	Для каждого ТекСтрока Из ТабЗаписи Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Техкарта = Ссылка;
		Запись.Состав = ТекСтрока.Состав;
		Запись.Количество = ТекСтрока.Количество;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ДополнитьТаблицуТехкарт(техКарта,ТабЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА торо_ТехКартыСписокОпераций.Операция ССЫЛКА Справочник.торо_ИдентификаторыТехКарт
	               |			ТОГДА торо_ВерсииТехКартСрезПоследних.ТехКарта
	               |		ИНАЧЕ торо_ТехКартыСписокОпераций.Операция
	               |	КОНЕЦ КАК Состав,
	               |	ВЫБОР
	               |		КОГДА торо_ТехКартыСписокОпераций.Операция ССЫЛКА Справочник.торо_ИдентификаторыТехКарт
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Операция_Техкарта,
	               |	торо_ТехКартыСписокОпераций.Количество
	               |ИЗ
	               |	Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&ДатаПринятия) КАК торо_ВерсииТехКартСрезПоследних
	               |		ПО торо_ТехКартыСписокОпераций.Операция = торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты
	               |ГДЕ
	               |	торо_ТехКартыСписокОпераций.Ссылка = &Ссылка
	               |	И торо_ТехКартыСписокОпераций.Операция ССЫЛКА Справочник.торо_ИдентификаторыТехКарт";
	
	Запрос.УстановитьПараметр("Ссылка",техКарта);
	Запрос.УстановитьПараметр("ДатаПринятия", новый Граница(ДатаПринятия,ВидГраницы.Включая));
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТабЗаписи.Добавить(),Выборка);
		ДополнитьТаблицуТехкарт(Выборка.Состав,ТабЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьНаличиеОпасныхОперацийВВышележащихТехКартах() 
	
	Если НЕ ДополнительныеСвойства.Свойство("ИзменилосьНаличиеОпасныхОпераций") 
		И НЕ ДополнительныеСвойства.Свойство("ИзменилосьНаличиеРаботПовышеннойОпасности") Тогда
		Возврат;
	КонецЕсли;
		
	МассивТехКартВерхнегоУровня = торо_ТехнологическиеКарты.ПолучитьВерсииТехКартНаОдинУровеньВыше(Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_ТехКарты.Ссылка КАК ТехКарта,
	|	торо_ТехКарты.СодержитОпасныеОперации КАК СодержитОпасныеОперации,
	|	торо_ТехКарты.СодержитРаботыПовышеннойОпасности КАК СодержитРаботыПовышеннойОпасности,
	|	торо_ТехКарты.ДатаПринятия КАК ДатаПринятия
	|ИЗ
	|	Справочник.торо_ТехКарты КАК торо_ТехКарты
	|ГДЕ
	|	торо_ТехКарты.Ссылка В(&МассивВерсий)
	|	И (торо_ТехКарты.СодержитОпасныеОперации <> &СодержитОпасныеОперации
	|			ИЛИ торо_ТехКарты.СодержитРаботыПовышеннойОпасности <> &СодержитРаботыПовышеннойОпасности)";
	
	Запрос.УстановитьПараметр("МассивВерсий", МассивТехКартВерхнегоУровня);
	Запрос.УстановитьПараметр("СодержитОпасныеОперации", СодержитОпасныеОперации);
	Запрос.УстановитьПараметр("СодержитРаботыПовышеннойОпасности", СодержитРаботыПовышеннойОпасности);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	торо_ТехнологическиеКарты.ОбновитьНаличиеОпасныхОперацийВТехКартах(Выборка, СодержитОпасныеОперации, СодержитРаботыПовышеннойОпасности); 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
